{
    "sequence_length": 30,
    "n_features": 11,
    "latent_dim": 16,
    "model_config": {
        "name": "LSTM_Autoencoder",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [
                        null,
                        30,
                        11
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_layer"
                },
                "registered_name": null,
                "name": "input_layer",
                "inbound_nodes": []
            },
            {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "zero_output_for_mask": false,
                    "units": 64,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "recurrent_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Orthogonal",
                        "config": {
                            "seed": null,
                            "gain": 1.0
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "unit_forget_bias": true,
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.0,
                    "recurrent_dropout": 0.0,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        30,
                        11
                    ]
                },
                "name": "lstm",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        30,
                                        11
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "input_layer",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false,
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "rate": 0.2,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null,
                "name": "dropout",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        30,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "lstm",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "return_sequences": false,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "zero_output_for_mask": false,
                    "units": 32,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "recurrent_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Orthogonal",
                        "config": {
                            "seed": null,
                            "gain": 1.0
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "unit_forget_bias": true,
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.0,
                    "recurrent_dropout": 0.0,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        30,
                        64
                    ]
                },
                "name": "lstm_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        30,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dropout",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false,
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "rate": 0.2,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null,
                "name": "dropout_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "lstm_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "latent",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 16,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32
                    ]
                },
                "name": "latent",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dropout_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "RepeatVector",
                "config": {
                    "name": "repeat_vector",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "n": 30
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16
                    ]
                },
                "name": "repeat_vector",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        16
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "latent",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm_2",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "zero_output_for_mask": false,
                    "units": 32,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "recurrent_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Orthogonal",
                        "config": {
                            "seed": null,
                            "gain": 1.0
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "unit_forget_bias": true,
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.0,
                    "recurrent_dropout": 0.0,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        30,
                        16
                    ]
                },
                "name": "lstm_2",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        30,
                                        16
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "repeat_vector",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false,
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_2",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "rate": 0.2,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null,
                "name": "dropout_2",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        30,
                                        32
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "lstm_2",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm_3",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "zero_output_for_mask": false,
                    "units": 64,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "recurrent_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Orthogonal",
                        "config": {
                            "seed": null,
                            "gain": 1.0
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "unit_forget_bias": true,
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.0,
                    "recurrent_dropout": 0.0,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        30,
                        32
                    ]
                },
                "name": "lstm_3",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        30,
                                        32
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dropout_2",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false,
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_3",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "rate": 0.2,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null,
                "name": "dropout_3",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        30,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "lstm_3",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "TimeDistributed",
                "config": {
                    "name": "time_distributed",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "layer": {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 11,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "registered_name": null,
                        "build_config": {
                            "input_shape": [
                                null,
                                64
                            ]
                        }
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        30,
                        64
                    ]
                },
                "name": "time_distributed",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        30,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dropout_3",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            }
        ],
        "input_layers": [
            "input_layer",
            0,
            0
        ],
        "output_layers": [
            "time_distributed",
            0,
            0
        ]
    }
}